src/cf/InformationRegisters/NotDeletedObjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>NotDeletedObjects</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AttemptsNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastAttemptTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Comment>ACC:1330 универсальный составной тип, т.к. возможна работа с любыми данными</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/NotDeletedObjects/Ext/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers
Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Count() = 0 Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text =
		"SELECT
		|	CurrentRecordSet.Object AS Object,
		|	1 AS AttemptsNumber,
		|	&CurrentAttemptTime AS LastAttemptTime
		|INTO Current_Set
		|FROM
		|	&CurrentRecordSet AS CurrentRecordSet
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Table.Object AS Object,
		|	SUM(Table.AttemptsNumber) AS AttemptsNumber,
		|	MAX(Table.LastAttemptTime) AS LastAttemptTime
		|FROM
		|	(SELECT
		|		NotDeletedObjects.Object AS Object,
		|		NotDeletedObjects.AttemptsNumber AS AttemptsNumber,
		|		NotDeletedObjects.LastAttemptTime AS LastAttemptTime
		|	FROM
		|		InformationRegister.NotDeletedObjects AS NotDeletedObjects
		|	WHERE
		|		NotDeletedObjects.Object IN
		|			(SELECT
		|				Tab.Object
		|			FROM
		|				Current_Set AS Tab)
		|
		|	UNION ALL
		|
		|	SELECT
		|		Current_Set.Object,
		|		Current_Set.AttemptsNumber,
		|		Current_Set.LastAttemptTime
		|	FROM
		|		Current_Set AS Current_Set) AS Table
		|GROUP BY
		|	Table.Object";
	
	Query.SetParameter("CurrentAttemptTime", Common.CurrentUserDate());
	Query.SetParameter("CurrentRecordSet", Unload());
	
	QueryResult = Query.Execute();
	SelectionDetailRecords = QueryResult.Select();
	
	Clear();
	While SelectionDetailRecords.Next() Do
		FillPropertyValues(Add(), SelectionDetailRecords);
	EndDo;
	
EndProcedure
#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
